package com.company;

public class Main {

    public static void main(String[] args) {
        String[] month = {"Январь", "Февраль", "Март", "Апрель", "Май", "Июнь",
                "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"};
        int[] day = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
        String[] season = {"зима", "зима", "весна", "весна", "весна", "лето",
                "лето", "лето", "осень", "осень", "осень", "зима"};

        for (int i = 0; i < 12; i++) {
            System.out.format("Месяц %s длится %d день(ей), принадлежит к сезону %s%n",
                    month[i], day[i], season[i]);
        }
    }
}
